title: Suspicious PowerShell Execution Detection

id: windows-powershell-detection-001

status: experimental

description: Detects suspicious PowerShell execution activity

author: Thabo Sakonta

logsource:
  product: windows
  category: process_creation

detection:

  selection:
    Image|endswith:
      - '\powershell.exe'

  condition:
    selection

level: medium